# 블로그 chapter6-1 내용 부분

In [1]:
import pandas as pd

In [2]:
import pymysql
conn=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='employees',charset='utf8')

In [3]:
cur=conn.cursor()

In [4]:
sql="SELECT * FROM titles"

In [5]:
cur.execute(sql)
rows=cur.fetchall()
conn.close()

In [6]:
pd=pd.DataFrame(rows)
pd.head()

       0                1           2           3
0  10001  Senior Engineer  1986-06-26  9999-01-01
1  10002            Staff  1996-08-03  9999-01-01
2  10003  Senior Engineer  1995-12-03  9999-01-01
3  10004         Engineer  1986-12-01  1995-12-01
4  10004  Senior Engineer  1995-12-01  9999-01-01